
print("-------步长为正数------")
#
lst = [10,20,30,40,50,60,70,80]
# start:1 stop:6 step:1  还是左闭右开
print(lst[1:6:1]) #[20, 30, 40, 50, 60]
print("原列表",id(lst))
lst2 = lst[1:6:1]
print("切的片段",id(lst2))

# 默认步长为1 不写或者只写：都可以
print(lst[1:6])
print(lst[1:6:])

print(lst[1:6:2]) #[20, 40, 60]

# start不写 默认0开始
print(lst[:6:2]) #[10, 30, 50]
# stop不写 默认到尾
print(lst[1::2]) #[20, 40, 60, 80]

print("-------步长为负数------")
print(lst[::-1]) #逆序输出 [80, 70, 60, 50, 40, 30, 20, 10]
print(lst[7::-1])# [80, 70, 60, 50, 40, 30, 20, 10]
print(lst[6:0:-2])# [70, 50, 30]