'''
注意集合是无序的！！

判断：in  not in
'''
s = {10,20,30,40,230,13}

print(10 in s) #t
print(10 not in s) #f
print(100 not in s) #t


'''
新增
1 .add() 一次添加一个元素
2 .update() 一次至少添加一个元素
'''
s.add(80)
print(s) #{230, 40, 10, 13, 80, 20, 30}
s.update({200,300,410}) #添加集合类型
print(s) #{230, 40, 200, 10, 300, 13, 80, 20, 410, 30}

print("---------还可以在里面添加列表和元组类型----------")
s.update([1,2,3])
s.update((11,22,33))
print(s) #{1, 2, 3, 33, 230, 40, 200, 10, 11, 300, 13, 80, 20, 22, 410, 30}

'''
集合的删除
1 .remove() 一次删除一个指定元素 指定元素不存在抛出keyError
2 .discard() 一次删除一个指定元素 不存在不报错
3 .pop() 一次删除任意一个元素 【不能指定参数 不然报错
4 .clear() 清空集合
'''

s.remove(1)
print(s)
# s.remove(500) #KeyError: 500
s.discard(500) #集合中没有也不报错

s.pop() #不能指定参数 否则会抛异常
print(s)
s.clear() #清空
print(s) #set()