# 顺序结构
print("----------------顺序结构---------------")
print("-------程序开始-------")
print("1 把冰箱门打开")
print("2 把大象放进去")
print("3 把冰箱门关上")
print("-------程序结束-------")
# 选择结构
print("----------------选择结构---------------")
print("--------单分支结构:if---------")
money = 1000 #余额
s = int(input("请输入取款金额：")) #取款金额
# 判断余额
if money >= s :
    money -= s
    print("取款成功，余额为：",money)

print("--------双分支结构:if else---------")
num = int(input("请输入一个整数，我来判断奇偶："))
if num%2 ==0:
    print(num,"是偶数")
else:
    print(num,"是奇数")




